{"modelTopology":{"node":[{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_13/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_12/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_12/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_12/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_13/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_13/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_11/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_10/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_10/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_10/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_11/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_11/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_9/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_8/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_8/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_8/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_9/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_9/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_7/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_6/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}}},"name":"instance_normalization_6/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_6/Reshape_1","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}}},"name":"conv2d_7/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_7/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_5/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_4/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_4/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_4/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_5/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_5/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"9"},{"size":"9"},{"size":"3"},{"size":"8"}]}}},"dtype":{"type":1}},"name":"conv2d_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"8"}]}}},"dtype":{"type":1}},"name":"instance_normalization_1/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"8"}]}}},"dtype":{"type":1}},"name":"instance_normalization_1/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"8"},{"size":"16"}]}}},"dtype":{"type":1}},"name":"conv2d_2/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"16"}]}}}},"name":"instance_normalization_2/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"16"}]}}},"dtype":{"type":1}},"name":"instance_normalization_2/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"conv2d_3/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_3/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"instance_normalization_3/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"16"}]}}},"dtype":{"type":1}},"name":"conv2d_14/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"16"}]}}},"dtype":{"type":1}},"name":"instance_normalization_14/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"16"}]}}},"dtype":{"type":1}},"name":"instance_normalization_14/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"up_sampling2d_1/strided_slice/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"up_sampling2d_1/strided_slice/stack","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":3}},"name":"up_sampling2d_1/Const","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"8"}]}}},"dtype":{"type":1}},"name":"conv2d_15/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"8"}]}}},"dtype":{"type":1}},"name":"instance_normalization_15/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"8"}]}}},"dtype":{"type":1}},"name":"instance_normalization_15/Reshape_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"9"},{"size":"9"},{"size":"8"},{"size":"3"}]}}},"dtype":{"type":1}},"name":"conv2d_16/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":3}},"name":"instance_normalization_16/Mean/reduction_indices","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[]}}},"dtype":{"type":1}},"name":"instance_normalization_12/add/y","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"3"}]}}},"dtype":{"type":1}},"name":"instance_normalization_16/Reshape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"3"}]}}},"dtype":{"type":1}},"name":"instance_normalization_16/Reshape_1","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[]}}}},"name":"deprocess_stylized_image_1/add/y","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[]}}},"dtype":{"type":1}},"name":"deprocess_stylized_image_1/mul/y","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"shape":{"shape":{"dim":[{"size": 256}, {"size": 256}, {"size": 3}]}}},"name":"input_1","op":"Placeholder"},{"input":["input_1","conv2d_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_1/convolution","op":"Conv2D"},{"input":["conv2d_1/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_1/Mean","op":"Mean"},{"input":["conv2d_1/convolution","instance_normalization_1/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_1/sub_1","op":"Sub"},{"input":["instance_normalization_1/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_1/Square","op":"Square"},{"input":["instance_normalization_1/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_1/Mean_2","op":"Mean"},{"input":["instance_normalization_1/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_1/Sqrt","op":"Sqrt"},{"input":["instance_normalization_1/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_1/add","op":"Add"},{"input":["instance_normalization_1/sub_1","instance_normalization_1/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_1/truediv","op":"RealDiv"},{"input":["instance_normalization_1/truediv","instance_normalization_1/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_1/mul","op":"Mul"},{"input":["instance_normalization_1/mul","instance_normalization_1/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_1/add_1","op":"Add"},{"input":["instance_normalization_1/add_1"],"attr":{"T":{"type":1}},"name":"activation_1/Relu","op":"Relu"},{"input":["activation_1/Relu","conv2d_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_2/convolution","op":"Conv2D"},{"input":["conv2d_2/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_2/Mean","op":"Mean"},{"input":["conv2d_2/convolution","instance_normalization_2/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_2/sub_1","op":"Sub"},{"input":["instance_normalization_2/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_2/Square","op":"Square"},{"input":["instance_normalization_2/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_2/Mean_2","op":"Mean"},{"input":["instance_normalization_2/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_2/Sqrt","op":"Sqrt"},{"input":["instance_normalization_2/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_2/add","op":"Add"},{"input":["instance_normalization_2/sub_1","instance_normalization_2/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_2/truediv","op":"RealDiv"},{"input":["instance_normalization_2/truediv","instance_normalization_2/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_2/mul","op":"Mul"},{"input":["instance_normalization_2/mul","instance_normalization_2/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_2/add_1","op":"Add"},{"input":["instance_normalization_2/add_1"],"attr":{"T":{"type":1}},"name":"activation_2/Relu","op":"Relu"},{"input":["activation_2/Relu","conv2d_3/kernel"],"attr":{"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"conv2d_3/convolution","op":"Conv2D"},{"input":["conv2d_3/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_3/Mean","op":"Mean"},{"input":["conv2d_3/convolution","instance_normalization_3/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_3/sub_1","op":"Sub"},{"input":["instance_normalization_3/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_3/Square","op":"Square"},{"input":["instance_normalization_3/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_3/Mean_2","op":"Mean"},{"input":["instance_normalization_3/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_3/Sqrt","op":"Sqrt"},{"input":["instance_normalization_3/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_3/add","op":"Add"},{"input":["instance_normalization_3/sub_1","instance_normalization_3/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_3/truediv","op":"RealDiv"},{"input":["instance_normalization_3/truediv","instance_normalization_3/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_3/mul","op":"Mul"},{"input":["instance_normalization_3/mul","instance_normalization_3/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_3/add_1","op":"Add"},{"input":["instance_normalization_3/add_1"],"attr":{"T":{"type":1}},"name":"activation_3/Relu","op":"Relu"},{"input":["activation_3/Relu","conv2d_4/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_4/convolution","op":"Conv2D"},{"input":["conv2d_4/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_4/Mean","op":"Mean"},{"input":["conv2d_4/convolution","instance_normalization_4/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_4/sub_1","op":"Sub"},{"input":["instance_normalization_4/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_4/Square","op":"Square"},{"input":["instance_normalization_4/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_4/Mean_2","op":"Mean"},{"input":["instance_normalization_4/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_4/Sqrt","op":"Sqrt"},{"input":["instance_normalization_4/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_4/add","op":"Add"},{"input":["instance_normalization_4/sub_1","instance_normalization_4/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_4/truediv","op":"RealDiv"},{"input":["instance_normalization_4/truediv","instance_normalization_4/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_4/mul","op":"Mul"},{"input":["instance_normalization_4/mul","instance_normalization_4/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_4/add_1","op":"Add"},{"input":["instance_normalization_4/add_1"],"attr":{"T":{"type":1}},"name":"activation_4/Relu","op":"Relu"},{"input":["activation_4/Relu","conv2d_5/kernel"],"attr":{"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"conv2d_5/convolution","op":"Conv2D"},{"input":["conv2d_5/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_5/Mean","op":"Mean"},{"input":["conv2d_5/convolution","instance_normalization_5/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_5/sub_1","op":"Sub"},{"input":["instance_normalization_5/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_5/Square","op":"Square"},{"input":["instance_normalization_5/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_5/Mean_2","op":"Mean"},{"input":["instance_normalization_5/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_5/Sqrt","op":"Sqrt"},{"input":["instance_normalization_5/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_5/add","op":"Add"},{"input":["instance_normalization_5/sub_1","instance_normalization_5/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_5/truediv","op":"RealDiv"},{"input":["instance_normalization_5/truediv","instance_normalization_5/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_5/mul","op":"Mul"},{"input":["instance_normalization_5/mul","activation_3/Relu"],"attr":{"T":{"type":1},"N":{"i":"2"},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true}},"name":"add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add","op":"AddN"},{"input":["instance_normalization_5/Reshape_1","add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"],"attr":{"T":{"type":1},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true}},"name":"add_1/ArithmeticOptimizer/AddOpsRewrite_add","op":"Add"},{"input":["add_1/ArithmeticOptimizer/AddOpsRewrite_add","conv2d_6/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_6/convolution","op":"Conv2D"},{"input":["conv2d_6/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_6/Mean","op":"Mean"},{"input":["conv2d_6/convolution","instance_normalization_6/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_6/sub_1","op":"Sub"},{"input":["instance_normalization_6/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_6/Square","op":"Square"},{"input":["instance_normalization_6/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_6/Mean_2","op":"Mean"},{"input":["instance_normalization_6/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_6/Sqrt","op":"Sqrt"},{"input":["instance_normalization_6/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_6/add","op":"Add"},{"input":["instance_normalization_6/sub_1","instance_normalization_6/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_6/truediv","op":"RealDiv"},{"input":["instance_normalization_6/truediv","instance_normalization_6/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_6/mul","op":"Mul"},{"input":["instance_normalization_6/mul","instance_normalization_6/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_6/add_1","op":"Add"},{"input":["instance_normalization_6/add_1"],"attr":{"T":{"type":1}},"name":"activation_5/Relu","op":"Relu"},{"input":["activation_5/Relu","conv2d_7/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_7/convolution","op":"Conv2D"},{"input":["conv2d_7/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_7/Mean","op":"Mean"},{"input":["conv2d_7/convolution","instance_normalization_7/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_7/sub_1","op":"Sub"},{"input":["instance_normalization_7/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_7/Square","op":"Square"},{"input":["instance_normalization_7/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_7/Mean_2","op":"Mean"},{"input":["instance_normalization_7/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_7/Sqrt","op":"Sqrt"},{"input":["instance_normalization_7/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_7/add","op":"Add"},{"input":["instance_normalization_7/sub_1","instance_normalization_7/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_7/truediv","op":"RealDiv"},{"input":["instance_normalization_7/truediv","instance_normalization_7/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_7/mul","op":"Mul"},{"input":["instance_normalization_7/mul","add_1/ArithmeticOptimizer/AddOpsRewrite_add"],"attr":{"N":{"i":"2"},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true},"T":{"type":1}},"name":"add_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add","op":"AddN"},{"input":["instance_normalization_7/Reshape_1","add_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"],"attr":{"T":{"type":1},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true}},"name":"add_2/ArithmeticOptimizer/AddOpsRewrite_add","op":"Add"},{"input":["add_2/ArithmeticOptimizer/AddOpsRewrite_add","conv2d_8/kernel"],"attr":{"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1}},"name":"conv2d_8/convolution","op":"Conv2D"},{"input":["conv2d_8/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_8/Mean","op":"Mean"},{"input":["conv2d_8/convolution","instance_normalization_8/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_8/sub_1","op":"Sub"},{"input":["instance_normalization_8/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_8/Square","op":"Square"},{"input":["instance_normalization_8/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_8/Mean_2","op":"Mean"},{"input":["instance_normalization_8/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_8/Sqrt","op":"Sqrt"},{"input":["instance_normalization_8/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_8/add","op":"Add"},{"input":["instance_normalization_8/sub_1","instance_normalization_8/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_8/truediv","op":"RealDiv"},{"input":["instance_normalization_8/truediv","instance_normalization_8/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_8/mul","op":"Mul"},{"input":["instance_normalization_8/mul","instance_normalization_8/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_8/add_1","op":"Add"},{"input":["instance_normalization_8/add_1"],"attr":{"T":{"type":1}},"name":"activation_6/Relu","op":"Relu"},{"input":["activation_6/Relu","conv2d_9/kernel"],"attr":{"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true}},"name":"conv2d_9/convolution","op":"Conv2D"},{"input":["conv2d_9/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_9/Mean","op":"Mean"},{"input":["conv2d_9/convolution","instance_normalization_9/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_9/sub_1","op":"Sub"},{"input":["instance_normalization_9/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_9/Square","op":"Square"},{"input":["instance_normalization_9/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_9/Mean_2","op":"Mean"},{"input":["instance_normalization_9/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_9/Sqrt","op":"Sqrt"},{"input":["instance_normalization_9/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_9/add","op":"Add"},{"input":["instance_normalization_9/sub_1","instance_normalization_9/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_9/truediv","op":"RealDiv"},{"input":["instance_normalization_9/truediv","instance_normalization_9/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_9/mul","op":"Mul"},{"input":["instance_normalization_9/mul","add_2/ArithmeticOptimizer/AddOpsRewrite_add"],"attr":{"T":{"type":1},"N":{"i":"2"},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true}},"name":"add_3/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add","op":"AddN"},{"input":["instance_normalization_9/Reshape_1","add_3/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"],"attr":{"T":{"type":1},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true}},"name":"add_3/ArithmeticOptimizer/AddOpsRewrite_add","op":"Add"},{"input":["add_3/ArithmeticOptimizer/AddOpsRewrite_add","conv2d_10/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_10/convolution","op":"Conv2D"},{"input":["conv2d_10/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_10/Mean","op":"Mean"},{"input":["conv2d_10/convolution","instance_normalization_10/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_10/sub_1","op":"Sub"},{"input":["instance_normalization_10/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_10/Square","op":"Square"},{"input":["instance_normalization_10/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_10/Mean_2","op":"Mean"},{"input":["instance_normalization_10/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_10/Sqrt","op":"Sqrt"},{"input":["instance_normalization_10/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_10/add","op":"Add"},{"input":["instance_normalization_10/sub_1","instance_normalization_10/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_10/truediv","op":"RealDiv"},{"input":["instance_normalization_10/truediv","instance_normalization_10/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_10/mul","op":"Mul"},{"input":["instance_normalization_10/mul","instance_normalization_10/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_10/add_1","op":"Add"},{"input":["instance_normalization_10/add_1"],"attr":{"T":{"type":1}},"name":"activation_7/Relu","op":"Relu"},{"input":["activation_7/Relu","conv2d_11/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_11/convolution","op":"Conv2D"},{"input":["conv2d_11/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_11/Mean","op":"Mean"},{"input":["conv2d_11/convolution","instance_normalization_11/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_11/sub_1","op":"Sub"},{"input":["instance_normalization_11/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_11/Square","op":"Square"},{"input":["instance_normalization_11/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_11/Mean_2","op":"Mean"},{"input":["instance_normalization_11/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_11/Sqrt","op":"Sqrt"},{"input":["instance_normalization_11/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_11/add","op":"Add"},{"input":["instance_normalization_11/sub_1","instance_normalization_11/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_11/truediv","op":"RealDiv"},{"input":["instance_normalization_11/truediv","instance_normalization_11/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_11/mul","op":"Mul"},{"input":["instance_normalization_11/mul","add_3/ArithmeticOptimizer/AddOpsRewrite_add"],"attr":{"N":{"i":"2"},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true},"T":{"type":1}},"name":"add_4/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add","op":"AddN"},{"input":["instance_normalization_11/Reshape_1","add_4/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"],"attr":{"T":{"type":1},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true}},"name":"add_4/ArithmeticOptimizer/AddOpsRewrite_add","op":"Add"},{"input":["add_4/ArithmeticOptimizer/AddOpsRewrite_add","conv2d_12/kernel"],"attr":{"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1}},"name":"conv2d_12/convolution","op":"Conv2D"},{"input":["conv2d_12/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_12/Mean","op":"Mean"},{"input":["conv2d_12/convolution","instance_normalization_12/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_12/sub_1","op":"Sub"},{"input":["instance_normalization_12/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_12/Square","op":"Square"},{"input":["instance_normalization_12/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_12/Mean_2","op":"Mean"},{"input":["instance_normalization_12/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_12/Sqrt","op":"Sqrt"},{"input":["instance_normalization_12/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_12/add","op":"Add"},{"input":["instance_normalization_12/sub_1","instance_normalization_12/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_12/truediv","op":"RealDiv"},{"input":["instance_normalization_12/truediv","instance_normalization_12/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_12/mul","op":"Mul"},{"input":["instance_normalization_12/mul","instance_normalization_12/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_12/add_1","op":"Add"},{"input":["instance_normalization_12/add_1"],"attr":{"T":{"type":1}},"name":"activation_8/Relu","op":"Relu"},{"input":["activation_8/Relu","conv2d_13/kernel"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"conv2d_13/convolution","op":"Conv2D"},{"input":["conv2d_13/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_13/Mean","op":"Mean"},{"input":["conv2d_13/convolution","instance_normalization_13/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_13/sub_1","op":"Sub"},{"input":["instance_normalization_13/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_13/Square","op":"Square"},{"input":["instance_normalization_13/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_13/Mean_2","op":"Mean"},{"input":["instance_normalization_13/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_13/Sqrt","op":"Sqrt"},{"input":["instance_normalization_13/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_13/add","op":"Add"},{"input":["instance_normalization_13/sub_1","instance_normalization_13/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_13/truediv","op":"RealDiv"},{"input":["instance_normalization_13/truediv","instance_normalization_13/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_13/mul","op":"Mul"},{"input":["instance_normalization_13/mul","add_4/ArithmeticOptimizer/AddOpsRewrite_add"],"attr":{"N":{"i":"2"},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true},"T":{"type":1}},"name":"add_5/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add","op":"AddN"},{"input":["instance_normalization_13/Reshape_1","add_5/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"],"attr":{"T":{"type":1},"_grappler:ArithmeticOptimizer:AddOpsRewriteStage":{"b":true}},"name":"add_5/ArithmeticOptimizer/AddOpsRewrite_add","op":"Add"},{"input":["add_5/ArithmeticOptimizer/AddOpsRewrite_add"],"attr":{"T":{"type":1},"out_type":{"type":3}},"name":"up_sampling2d_1/Shape","op":"Shape"},{"input":["up_sampling2d_1/Shape","up_sampling2d_1/strided_slice/stack","up_sampling2d_1/strided_slice/stack_1","up_sampling2d_1/strided_slice/stack"],"attr":{"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"Index":{"type":3},"T":{"type":3},"shrink_axis_mask":{"i":"0"},"begin_mask":{"i":"0"},"ellipsis_mask":{"i":"0"}},"name":"up_sampling2d_1/strided_slice","op":"StridedSlice"},{"input":["up_sampling2d_1/strided_slice","up_sampling2d_1/Const"],"attr":{"T":{"type":3}},"name":"up_sampling2d_1/mul","op":"Mul"},{"input":["add_5/ArithmeticOptimizer/AddOpsRewrite_add","up_sampling2d_1/mul"],"attr":{"T":{"type":1},"align_corners":{"b":false}},"name":"up_sampling2d_1/ResizeNearestNeighbor","op":"ResizeNearestNeighbor"},{"input":["up_sampling2d_1/ResizeNearestNeighbor","conv2d_14/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_14/convolution","op":"Conv2D"},{"input":["conv2d_14/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_14/Mean","op":"Mean"},{"input":["conv2d_14/convolution","instance_normalization_14/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_14/sub_1","op":"Sub"},{"input":["instance_normalization_14/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_14/Square","op":"Square"},{"input":["instance_normalization_14/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"instance_normalization_14/Mean_2","op":"Mean"},{"input":["instance_normalization_14/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_14/Sqrt","op":"Sqrt"},{"input":["instance_normalization_14/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_14/add","op":"Add"},{"input":["instance_normalization_14/sub_1","instance_normalization_14/add"],"attr":{"T":{"type":1}},"name":"instance_normalization_14/truediv","op":"RealDiv"},{"input":["instance_normalization_14/truediv","instance_normalization_14/Reshape"],"attr":{"T":{"type":1}},"name":"instance_normalization_14/mul","op":"Mul"},{"input":["instance_normalization_14/mul","instance_normalization_14/Reshape_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_14/add_1","op":"Add"},{"input":["instance_normalization_14/add_1"],"attr":{"T":{"type":1}},"name":"activation_9/Relu","op":"Relu"},{"input":["activation_9/Relu"],"attr":{"T":{"type":1},"out_type":{"type":3}},"name":"up_sampling2d_2/Shape","op":"Shape"},{"input":["up_sampling2d_2/Shape","up_sampling2d_1/strided_slice/stack","up_sampling2d_1/strided_slice/stack_1","up_sampling2d_1/strided_slice/stack"],"attr":{"shrink_axis_mask":{"i":"0"},"begin_mask":{"i":"0"},"ellipsis_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"Index":{"type":3},"T":{"type":3}},"name":"up_sampling2d_2/strided_slice","op":"StridedSlice"},{"input":["up_sampling2d_2/strided_slice","up_sampling2d_1/Const"],"attr":{"T":{"type":3}},"name":"up_sampling2d_2/mul","op":"Mul"},{"input":["activation_9/Relu","up_sampling2d_2/mul"],"attr":{"T":{"type":1},"align_corners":{"b":false}},"name":"up_sampling2d_2/ResizeNearestNeighbor","op":"ResizeNearestNeighbor"},{"input":["up_sampling2d_2/ResizeNearestNeighbor","conv2d_15/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"conv2d_15/convolution","op":"Conv2D"},{"input":["conv2d_15/convolution","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_15/Mean","op":"Mean"},{"input":["conv2d_15/convolution","instance_normalization_15/Mean"],"attr":{"T":{"type":1}},"name":"instance_normalization_15/sub_1","op":"Sub"},{"input":["instance_normalization_15/sub_1"],"attr":{"T":{"type":1}},"name":"instance_normalization_15/Square","op":"Square"},{"input":["instance_normalization_15/Square","instance_normalization_16/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"instance_normalization_15/Mean_2","op":"Mean"},{"input":["instance_normalization_15/Mean_2"],"attr":{"T":{"type":1}},"name":"instance_normalization_15/Sqrt","op":"Sqrt"},{"input":["instance_normalization_15/Sqrt","instance_normalization_12/add/y"],"attr":{"T":{"type":1}},"name":"instance_normalization_15/add","op":"Add"},