{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "stem_conv1", "class_name": "Conv2D", "config": {"name": "stem_conv1", "trainable": false, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "stem_bn1", "class_name": "BatchNormalization", "config": {"name": "stem_bn1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_conv1", 0, 0, {}]]]}, {"name": "activation_298", "class_name": "Activation", "config": {"name": "activation_298", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "reduction_conv_1_stem_1", "class_name": "Conv2D", "config": {"name": "reduction_conv_1_stem_1", "trainable": false, "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_298", 0, 0, {}]]]}, {"name": "reduction_bn_1_stem_1", "class_name": "BatchNormalization", "config": {"name": "reduction_bn_1_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["reduction_conv_1_stem_1", 0, 0, {}]]]}, {"name": "activation_299", "class_name": "Activation", "config": {"name": "activation_299", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]]}, {"name": "activation_301", "class_name": "Activation", "config": {"name": "activation_301", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_left1_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_left1_stem_1", "trainable": false, "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_299", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right1_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right1_stem_1", "trainable": false, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_301", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_left1_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left1_stem_1", "trainable": false, "filters": 11, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_left1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right1_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right1_stem_1", "trainable": false, "filters": 11, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_left1_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left1_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right1_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right1_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "activation_300", "class_name": "Activation", "config": {"name": "activation_300", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_1", 0, 0, {}]]]}, {"name": "activation_302", "class_name": "Activation", "config": {"name": "activation_302", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_left1_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left1_stem_1", "trainable": false, "filters": 11, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_300", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right1_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right1_stem_1", "trainable": false, "filters": 11, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_302", 0, 0, {}]]]}, {"name": "activation_303", "class_name": "Activation", "config": {"name": "activation_303", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_left1_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left1_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right1_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right1_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right2_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right2_stem_1", "trainable": false, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_303", 0, 0, {}]]]}, {"name": "activation_305", "class_name": "Activation", "config": {"name": "activation_305", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "reduction_add_1_stem_1", "class_name": "Add", "config": {"name": "reduction_add_1_stem_1", "trainable": false}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right2_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right2_stem_1", "trainable": false, "filters": 11, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right3_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right3_stem_1", "trainable": false, "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_305", 0, 0, {}]]]}, {"name": "activation_307", "class_name": "Activation", "config": {"name": "activation_307", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right2_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right2_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right3_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right3_stem_1", "trainable": false, "filters": 11, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_left4_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left4_stem_1", "trainable": false, "filters": 11, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_307", 0, 0, {}]]]}, {"name": "activation_304", "class_name": "Activation", "config": {"name": "activation_304", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right3_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right3_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_left4_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left4_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_1", 0, 0, {}]]]}, {"name": "reduction_pad_1_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "reduction_pad_1_stem_1", "trainable": false, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right2_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right2_stem_1", "trainable": false, "filters": 11, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_304", 0, 0, {}]]]}, {"name": "activation_306", "class_name": "Activation", "config": {"name": "activation_306", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "activation_308", "class_name": "Activation", "config": {"name": "activation_308", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_1", 0, 0, {}]]]}, {"name": "reduction_left2_stem_1", "class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_1", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right2_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right2_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right3_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right3_stem_1", "trainable": false, "filters": 11, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_306", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_left4_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left4_stem_1", "trainable": false, "filters": 11, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_308", 0, 0, {}]]]}, {"name": "adjust_relu_1_stem_2", "class_name": "Activation", "config": {"name": "adjust_relu_1_stem_2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "reduction_add_2_stem_1", "class_name": "Add", "config": {"name": "reduction_add_2_stem_1", "trainable": false}, "inbound_nodes": [[["reduction_left2_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "reduction_left3_stem_1", "class_name": "AveragePooling2D", "config": {"name": "reduction_left3_stem_1", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right3_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right3_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "reduction_left4_stem_1", "class_name": "AveragePooling2D", "config": {"name": "reduction_left4_stem_1", "trainable": false, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_left4_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left4_stem_1", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_left4_stem_1", 0, 0, {}]]]}, {"name": "reduction_right5_stem_1", "class_name": "MaxPooling2D", "config": {"name": "reduction_right5_stem_1", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"name": "zero_padding2d_15", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": false, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]]}, {"name": "reduction_add3_stem_1", "class_name": "Add", "config": {"name": "reduction_add3_stem_1", "trainable": false}, "inbound_nodes": [[["reduction_left3_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": false}, "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_left4_stem_1", 0, 0, {}]]]}, {"name": "reduction_add4_stem_1", "class_name": "Add", "config": {"name": "reduction_add4_stem_1", "trainable": false}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left4_stem_1", 0, 0, {}], ["reduction_right5_stem_1", 0, 0, {}]]]}, {"name": "cropping2d_1", "class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": false, "cropping": [[1, 0], [1, 0]], "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"name": "reduction_concat_stem_1", "class_name": "Concatenate", "config": {"name": "reduction_concat_stem_1", "trainable": false, "axis": -1}, "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_add3_stem_1", 0, 0, {}], ["add_1", 0, 0, {}], ["reduction_add4_stem_1", 0, 0, {}]]]}, {"name": "adjust_avg_pool_1_stem_2", "class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_1_stem_2", "trainable": false, "pool_size": [1, 1], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]]}, {"name": "adjust_avg_pool_2_stem_2", "class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_2_stem_2", "trainable": false, "pool_size": [1, 1], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"name": "activation_309", "class_name": "Activation", "config": {"name": "activation_309", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["reduction_concat_stem_1", 0, 0, {}]]]}, {"name": "adjust_conv_1_stem_2", "class_name": "Conv2D", "config": {"name": "adjust_conv_1_stem_2", "trainable": false, "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["adjust_avg_pool_1_stem_2", 0, 0, {}]]]}, {"name": "adjust_conv_2_stem_2", "class_name": "Conv2D", "config": {"name": "adjust_conv_2_stem_2", "trainable": false, "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["adjust_avg_pool_2_stem_2", 0, 0, {}]]]}, {"name": "reduction_conv_1_stem_2", "class_name": "Conv2D", "config": {"name": "reduction_conv_1_stem_2", "trainable": false, "filters": 22, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_309", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": false, "axis": -1}, "inbound_nodes": [[["adjust_conv_1_stem_2", 0, 0, {}], ["adjust_conv_2_stem_2", 0, 0, {}]]]}, {"name": "reduction_bn_1_stem_2", "class_name": "BatchNormalization", "config": {"name": "reduction_bn_1_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["reduction_conv_1_stem_2", 0, 0, {}]]]}, {"name": "adjust_bn_stem_2", "class_name": "BatchNormalization", "config": {"name": "adjust_bn_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "activation_310", "class_name": "Activation", "config": {"name": "activation_310", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]]}, {"name": "activation_312", "class_name": "Activation", "config": {"name": "activation_312", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_left1_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_left1_stem_2", "trainable": false, "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_310", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right1_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right1_stem_2", "trainable": false, "padding": [[2, 3], [2, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_312", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_left1_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left1_stem_2", "trainable": false, "filters": 22, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_left1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right1_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right1_stem_2", "trainable": false, "filters": 22, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_left1_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left1_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right1_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right1_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "activation_311", "class_name": "Activation", "config": {"name": "activation_311", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_2", 0, 0, {}]]]}, {"name": "activation_313", "class_name": "Activation", "config": {"name": "activation_313", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_left1_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left1_stem_2", "trainable": false, "filters": 22, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_311", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right1_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right1_stem_2", "trainable": false, "filters": 22, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_313", 0, 0, {}]]]}, {"name": "activation_314", "class_name": "Activation", "config": {"name": "activation_314", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_left1_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left1_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right1_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right1_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right2_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right2_stem_2", "trainable": false, "padding": [[2, 3], [2, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_314", 0, 0, {}]]]}, {"name": "activation_316", "class_name": "Activation", "config": {"name": "activation_316", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"name": "reduction_add_1_stem_2", "class_name": "Add", "config": {"name": "reduction_add_1_stem_2", "trainable": false}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_2", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right2_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right2_stem_2", "trainable": false, "filters": 22, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right2_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right3_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right3_stem_2", "trainable": false, "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_316", 0, 0, {}]]]}, {"name": "activation_318", "class_name": "Activation", "config": {"name": "activation_318", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["reduction_add_1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right2_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right2_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right3_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right3_stem_2", "trainable": false, "filters": 22, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right3_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_left4_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left4_stem_2", "trainable": false, "filters": 22, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_318", 0, 0, {}]]]}, {"name": "activation_315", "class_name": "Activation", "config": {"name": "activation_315", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right3_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right3_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_left4_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left4_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_2", 0, 0, {}]]]}, {"name": "reduction_pad_1_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "reduction_pad_1_stem_2", "trainable": false, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right2_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right2_stem_2", "trainable": false, "filters": 22, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_315", 0, 0, {}]]]}, {"name": "activation_317", "class_name": "Activation", "config": {"name": "activation_317", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_2", 0, 0, {}]]]}, {"name": "activation_319", "class_name": "Activation", "config": {"name": "activation_319", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_2", 0, 0, {}]]]}, {"name": "reduction_left2_stem_2", "class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_2", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_pad_1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right2_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right2_stem_2", "trainable": false, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right2_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right3_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right3_stem_2", "trainable": false, "filters": 22, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_317", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_left4_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left4_stem_2", "trainable": false, "filters": 22, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": 